# Univariate Analysis

## Measure of central tendency

1. Mean
2. Meadian
3. Mode

In [15]:
# Mean = Average
# Median = Middle value
# Mode = Most repeated value

In [16]:
import numpy as np
import pandas as pd

In [17]:
# read file

df = pd.read_excel('Online_Store_customer_data.xlsx')
df.head(4)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Amount_spent
0,2019-01-01,151200,Female,19,Single,Kansas,Basic,Unemployment,Other,2051.36
1,2019-01-01,151201,Male,49,Single,Illinois,Basic,self-employed,Card,544.04
2,2019-01-01,151202,Male,63,Married,New Mexico,Basic,workers,PayPal,1572.60
3,2019-01-01,151203,Female,18,Single,Virginia,Platinum,workers,Card,1199.79

In [18]:
# for display how many unique values are there 
df['Segment'].nunique()

4

In [19]:
# for display uniqe values 
df['Segment'].unique()

array(['Basic', 'Platinum', 'Silver', 'Gold'], dtype=object)

In [20]:
# Calculate Mean
mean = df['Age'].mean()

# Calculate Median
median = df['Age'].median()

#Calculate Mode
mode = df['Age'].mode().iloc[0]

print(" Mean of Age :", mean)
print(f" Median of Age : {median}")
print(f" Mode of Age : {mode}")

 Mean of Age : 45.92
 Median of Age : 46.0
 Mode of Age : 43

In [26]:
mode = df['Age'].mode()
mode

0    43
1    45
Name: Age, dtype: int64

In [28]:
mode = df['Age'].mode().iloc[1]
mode

45

In [22]:
# Calculate Mean
mean = df['Amount_spent'].mean()

# Calculate Median
median = df['Amount_spent'].median()

#Calculate Mode
mode = df['Amount_spent'].mode().iloc[0]

print(f" Mean of Amount_spent : {mean}")
print(f" Median of Amount_spent : {median}")
print(f" Mode of Amount_spent : {mode}")

 Mean of Amount_spent : 1544.820933333333
 Median of Amount_spent : 1591.365
 Mode of Amount_spent : 685.49

In [23]:
df.describe()

       Transaction_ID         Age  Amount_spent
count      150.000000  150.000000    150.000000
mean    151367.573333   45.920000   1544.820933
std        125.167289   17.221619    866.790063
min     151200.000000   15.000000     15.370000
25%     151284.250000   33.000000    807.395000
50%     151332.500000   46.000000   1591.365000
75%     151476.750000   59.000000   2413.275000
max     151585.000000   77.000000   2999.980000

In [24]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Transaction_ID,150.0,151367.573333,125.167289,151200.00,151284.250,151332.500,151476.750,151585.00
Age,150.0,45.920000,17.221619,15.00,33.000,46.000,59.000,77.00
Amount_spent,150.0,1544.820933,866.790063,15.37,807.395,1591.365,2413.275,2999.98

In [25]:
df.describe(include=object).T

                 count unique        top freq
Gender             150      2     Female   86
Marital_status     150      2    Married   97
State_names        150     47   Colorado    7
Segment            150      4      Basic   76
Employees_status   150      4  Employees   52
Payment_method     150      3     PayPal   66